app/views/devise/registrations/edit.html.erb

SELECT "allergies".* FROM "allergies" INNER JOIN "allergies_users" ON "allergies"."id" = "allergies_users"."allergy_id" WHERE "allergies_users"."user_id" = $1  [["user_id", 1]]
---
          <li>Current Allergies
           <% @current_user.allergies.each do |allergy| %>