app/views/comments/_comment.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
    <ul>
      <li><span style="color:red"><% if comment.important %><span class="glyphicon glyphicon-flag"></span><%end%></span>Created by: <%= comment.writer %><% if current_user == User.find(comment.user_id)%><% if comment.body %><div id="comment" class='btn btn-warning btn-xs'> <%= link_to 'X', comment, method: :delete, data: { confirm: 'Are you sure?' } %></div><%end%><%end%></li>