app/views/recipes/index.html.erb

          <li><em>Current Allergies :</em>
           <% @current_user.allergies.each do |allergy| %>
---
SELECT "allergies".* FROM "allergies" INNER JOIN "allergies_users" ON "allergies"."id" = "allergies_users"."allergy_id" WHERE "allergies_users"."user_id" = $1  [["user_id", 1]]