app/views/recipes/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."recipe_id" = $1  [["recipe_id", 4]]
---
      </div> <ul>
        <% if @recipe.comments.size > 1 %>