app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.user = current_user
    @comment.writer = current_user.name
    @comment.recipe = Recipe.find(params[:recipe_id])
    @comment.save!
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("important", "body", "user_id", "writer", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"