app/controllers/recipes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def set_user
    @user = User.find(params[:user_id])

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 4]]
---
  def set_recipe
    @recipe = Recipe.find(params[:id])