app/controllers/welcome_controller.rb

SELECT "allergies".* FROM "allergies"
---
  def index
    @allergies = Allergy.all